## Final Project Submission

Please fill out:
* Student name: Jody Haring
* Student pace: self paced
* Scheduled project review date/time: 
* Instructor name: Matt Carr
* Blog post URL:

In [88]:
# Your code here - remember to use markdown cells for comments as well!
import pandas as pd
import numpy as np
import sqlite3

In [89]:
!ls zippedData

bom.movie_gross.csv.gz  im.db.zip               rt.reviews.tsv.gz
credits.csv             movies_metadata.csv     tmdb.movies.csv.gz
im.db                   rt.movie_info.tsv.gz    tn.movie_budgets.csv.gz

## Budget

In [90]:
# Budget
budget_df = pd.read_csv('zippedData/tn.movie_budgets.csv.gz')

budget_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

In [91]:
budget_df.head(10)       ## Has production_budget as a string, movie titles could have issues
                         ## if trying to join with other df, no imbd id number. 5,782 entries with no 
                         ## null values.

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"
5,6,"Dec 18, 2015",Star Wars Ep. VII: The Force Awakens,"$306,000,000","$936,662,225","$2,053,311,220"
6,7,"Apr 27, 2018",Avengers: Infinity War,"$300,000,000","$678,815,482","$2,048,134,200"
7,8,"May 24, 2007",Pirates of the Caribbean: At Worldâs End,"$300,000,000","$309,420,425","$963,420,425"
8,9,"Nov 17, 2017",Justice League,"$300,000,000","$229,024,295","$655,945,209"
9,10,"Nov 6, 2015",Spectre,"$300,000,000","$200,074,175","$879,620,923"

In [92]:
budget_df['production_budget']

0       $425,000,000
1       $410,600,000
2       $350,000,000
3       $330,600,000
4       $317,000,000
            ...
5777          $7,000
5778          $6,000
5779          $5,000
5780          $1,400
5781          $1,100
Name: production_budget, Length: 5782, dtype: object

In [93]:
budget_df["worldwide_gross"]     ## HAS ZERO VALUES ##

0       $2,776,345,279
1       $1,045,663,875
2         $149,762,350
3       $1,403,013,963
4       $1,316,721,747
             ...
5777                $0
5778          $240,495
5779            $1,338
5780                $0
5781          $181,041
Name: worldwide_gross, Length: 5782, dtype: object

## Total World Gross

In [94]:
gross_df = pd.read_csv('zippedData/bom.movie_gross.csv.gz')

In [95]:
gross_df.info()        ### Only has 3,387 entries and only 2,037 for foreign gross ###

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

Convert total_gross to a meaningful number

In [96]:
gross_df['foreign_gross'] = gross_df['foreign_gross'].str.replace(",","").astype(float)

In [97]:
gross_df['total_gross'] = gross_df['domestic_gross']+gross_df['foreign_gross']

In [98]:
# What happens if I convert total_gross to an int? 
gross_df['total_gross'] = gross_df['total_gross'].fillna(0).astype(int)
gross_df.head(10)

,title,studio,domestic_gross,foreign_gross,year,total_gross
0,Toy Story 3,BV,415000000.0,652000000.0,2010,1067000000
1,Alice in Wonderland (2010),BV,334200000.0,691300000.0,2010,1025500000
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000.0,2010,960300000
3,Inception,WB,292600000.0,535700000.0,2010,828300000
4,Shrek Forever After,P/DW,238700000.0,513900000.0,2010,752600000
5,The Twilight Saga: Eclipse,Sum.,300500000.0,398000000.0,2010,698500000
6,Iron Man 2,Par.,312400000.0,311500000.0,2010,623900000
7,Tangled,BV,200800000.0,391000000.0,2010,591800000
8,Despicable Me,Uni.,251500000.0,291600000.0,2010,543100000
9,How to Train Your Dragon,P/DW,217600000.0,277300000.0,2010,494900000

In [99]:
total_gross_df = gross_df.sort_values(by=['total_gross'], ascending=False)

In [100]:
gross_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   float64
 4   year            3387 non-null   int64
 5   total_gross     3387 non-null   int64
dtypes: float64(2), int64(2), object(2)
memory usage: 158.9+ KB

# SQL database 
 ### movie_basics table
  - has imdb movie_id
  - original_title
  - runtime_minutes
  - start_year
  - genres

In [101]:
conn = sqlite3.connect('zippedData/im.db')

In [102]:
cur = conn.cursor()

In [103]:
q = """
SELECT movie_id, primary_title, runtime_minutes, start_year, genres 
FROM movie_basics
WHERE start_year <= 2018
ORDER BY start_year
"""
imdb_df = pd.read_sql(q, conn)

In [104]:
null_values_length_q = """
SELECT primary_title, runtime_minutes
FROM movie_basics
WHERE runtime_minutes IS NULL
;
"""
pd.read_sql(null_values_length_q, conn)

                                           primary_title runtime_minutes
0                                        Sabse Bada Sukh            None
1                                                Bigfoot            None
2                                             O Silêncio            None
3      How Huang Fei-hong Rescued the Orphan from the...            None
4                                              Godfather            None
...                                                  ...             ...
31734                                    Bobbyr Bondhura            None
31735                                The Secret of China            None
31736        Rodolpho Teóphilo - O Legado de um Pioneiro            None
31737                                    Dankyavar Danka            None
31738                     Chico Albuquerque - Revelações            None

[31739 rows x 2 columns]

In [105]:
movie_info_df = pd.read_csv('zippedData/rt.movie_info.tsv.gz', sep = '\t')

In [106]:
movie_info_df        ## Has rating and runtime, can also search genre for 'Kids and Family' ##   
                           ## Only has 1,560 movies  ##

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
1,3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One
2,5,Illeana Douglas delivers a superb performance ...,R,Drama|Musical and Performing Arts,Allison Anders,Allison Anders,"Sep 13, 1996","Apr 18, 2000",NaN,NaN,116 minutes,NaN
3,6,Michael Douglas runs afoul of a treacherous su...,R,Drama|Mystery and Suspense,Barry Levinson,Paul Attanasio|Michael Crichton,"Dec 9, 1994","Aug 27, 1997",NaN,NaN,128 minutes,NaN
4,7,NaN,NR,Drama|Romance,Rodney Bennett,Giles Cooper,NaN,NaN,NaN,NaN,200 minutes,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
1555,1996,Forget terrorists or hijackers -- there's a ha...,R,Action and Adventure|Horror|Mystery and Suspense,NaN,NaN,"Aug 18, 2006","Jan 2, 2007",$,"33,886,034",106 minutes,New Line Cinema
1556,1997,The popular Saturday Night Live sketch was exp...,PG,Comedy|Science Fiction and Fantasy,Steve Barron,Terry Turner|Tom Davis|Dan Aykroyd|Bonnie Turner,"Jul 23, 1993","Apr 17, 2001",NaN,NaN,88 minutes,Paramount Vantage
1557,1998,"Based on a novel by Richard Powell, when the l...",G,Classics|Comedy|Drama|Musical and Performing Arts,Gordon Douglas,NaN,"Jan 1, 1962","May 11, 2004",NaN,NaN,111 minutes,NaN
1558,1999,The Sandlot is a coming-of-age story about a g...,PG,Comedy|Drama|Kids and Family|Sports and Fitness,David Mickey Evans,David Mickey Evans|Robert Gunter,"Apr 1, 1993","Jan 29, 2002",NaN,NaN,101 minutes,NaN
1559,2000,"Suspended from the force, Paris cop Hubert is ...",R,Action and Adventure|Art House and Internation...,NaN,Luc Besson,"Sep 27, 2001","Feb 11, 2003",NaN,NaN,94 minutes,Columbia Pictures

In [107]:
movie_info_df.drop(columns=['synopsis','director','writer','dvd_date','studio'])

,id,rating,genre,theater_date,currency,box_office,runtime
0,1,R,Action and Adventure|Classics|Drama,"Oct 9, 1971",NaN,NaN,104 minutes
1,3,R,Drama|Science Fiction and Fantasy,"Aug 17, 2012",$,"600,000",108 minutes
2,5,R,Drama|Musical and Performing Arts,"Sep 13, 1996",NaN,NaN,116 minutes
3,6,R,Drama|Mystery and Suspense,"Dec 9, 1994",NaN,NaN,128 minutes
4,7,NR,Drama|Romance,NaN,NaN,NaN,200 minutes
...,...,...,...,...,...,...,...
1555,1996,R,Action and Adventure|Horror|Mystery and Suspense,"Aug 18, 2006",$,"33,886,034",106 minutes
1556,1997,PG,Comedy|Science Fiction and Fantasy,"Jul 23, 1993",NaN,NaN,88 minutes
1557,1998,G,Classics|Comedy|Drama|Musical and Performing Arts,"Jan 1, 1962",NaN,NaN,111 minutes
1558,1999,PG,Comedy|Drama|Kids and Family|Sports and Fitness,"Apr 1, 1993",NaN,NaN,101 minutes
1559,2000,R,Action and Adventure|Art House and Internation...,"Sep 27, 2001",NaN,NaN,94 minutes

In [108]:
movie_info_df.groupby('rating').count()

,id,synopsis,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
rating,,,,,,,,,,,
G,57,56,57,51,38,48,48,9,9,57,13
NC17,1,1,1,1,1,1,1,1,1,1,1
NR,503,446,499,420,286,251,251,19,19,482,55
PG,240,240,240,209,185,204,204,52,52,239,77
PG-13,235,235,235,213,191,228,228,117,117,232,143
R,521,520,520,467,410,469,469,142,142,519,205

### New data from Kaggle, will need to get info for crediting if I use
 - movies_metadata.csv

In [109]:
metadata_df = pd.read_csv('zippedData/movies_metadata.csv')

/Users/jodyharing/opt/anaconda3/envs/learn-env/lib/python3.8/site-packages/IPython/core/interactiveshell.py:3145: DtypeWarning: Columns (10) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [110]:
metadata_df

,adult,belongs_to_collection,budget,genres,homepage,id,imdb_id,original_language,original_title,overview,...,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count
0,False,"{'id': 10194, 'name': 'Toy Story Collection', ...",30000000,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",http://toystory.disney.com/toy-story,862,tt0114709,en,Toy Story,"Led by Woody, Andy's toys live happily in his ...",...,1995-10-30,373554033.0,81.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,NaN,Toy Story,False,7.7,5415.0
1,False,NaN,65000000,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...",NaN,8844,tt0113497,en,Jumanji,When siblings Judy and Peter discover an encha...,...,1995-12-15,262797249.0,104.0,"[{'iso_639_1': 'en', 'name': 'English'}, {'iso...",Released,Roll the dice and unleash the excitement!,Jumanji,False,6.9,2413.0
2,False,"{'id': 119050, 'name': 'Grumpy Old Men Collect...",0,"[{'id': 10749, 'name': 'Romance'}, {'id': 35, ...",NaN,15602,tt0113228,en,Grumpier Old Men,A family wedding reignites the ancient feud be...,...,1995-12-22,0.0,101.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Still Yelling. Still Fighting. Still Ready for...,Grumpier Old Men,False,6.5,92.0
3,False,NaN,16000000,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...",NaN,31357,tt0114885,en,Waiting to Exhale,"Cheated on, mistreated and stepped on, the wom...",...,1995-12-22,81452156.0,127.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Friends are the people who let you be yourself...,Waiting to Exhale,False,6.1,34.0
4,False,"{'id': 96871, 'name': 'Father of the Bride Col...",0,"[{'id': 35, 'name': 'Comedy'}]",NaN,11862,tt0113041,en,Father of the Bride Part II,Just when George Banks has recovered from his ...,...,1995-02-10,76578911.0,106.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,Just When His World Is Back To Normal... He's ...,Father of the Bride Part II,False,5.7,173.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
45461,False,NaN,0,"[{'id': 18, 'name': 'Drama'}, {'id': 10751, 'n...",http://www.imdb.com/title/tt6209470/,439050,tt6209470,fa,رگ خواب,Rising and falling between a man and woman.,...,NaN,0.0,90.0,"[{'iso_639_1': 'fa', 'name': 'فارسی'}]",Released,Rising and falling between a man and woman,Subdue,False,4.0,1.0
45462,False,NaN,0,"[{'id': 18, 'name': 'Drama'}]",NaN,111109,tt2028550,tl,Siglo ng Pagluluwal,An artist struggles to finish his work while a...,...,2011-11-17,0.0,360.0,"[{'iso_639_1': 'tl', 'name': ''}]",Released,NaN,Century of Birthing,False,9.0,3.0
45463,False,NaN,0,"[{'id': 28, 'name': 'Action'}, {'id': 18, 'nam...",NaN,67758,tt0303758,en,Betrayal,"When one of her hits goes wrong, a professiona...",...,2003-08-01,0.0,90.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,A deadly game of wits.,Betrayal,False,3.8,6.0
45464,False,NaN,0,[],NaN,227506,tt0008536,en,Satana likuyushchiy,"In a small town live two brothers, one a minis...",...,1917-10-21,0.0,87.0,[],Released,NaN,Satan Triumphant,False,0.0,0.0
45465,False,NaN,0,[],NaN,461257,tt6980792,en,Queerama,50 years after decriminalisation of homosexual...,...,2017-06-09,0.0,75.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,NaN,Queerama,False,0.0,0.0

### Create a df from this dataFrame for movies beteen 2010 and 2018 with no missing values for 
 - runtime
 - release_date (format to year only)
 - imbd_id
 ### Include
 - budget
 - adult or family
 - original title

In [111]:
# Replace null values in 'release_date' with 9999. This will make it so your apply function works.
metadata_df['release_date'] = metadata_df['release_date'].fillna('9999')

In [112]:
# get movies from 2010 to 2018 first
# create column for release_date
metadata_df['year_release'] = metadata_df['release_date'].apply(lambda x: x[:4])

In [113]:
metadata_df.head(2)

,adult,belongs_to_collection,budget,genres,homepage,id,imdb_id,original_language,original_title,overview,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,year_release
0,False,"{'id': 10194, 'name': 'Toy Story Collection', ...",30000000,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",http://toystory.disney.com/toy-story,862,tt0114709,en,Toy Story,"Led by Woody, Andy's toys live happily in his ...",...,373554033.0,81.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,NaN,Toy Story,False,7.7,5415.0,1995
1,False,NaN,65000000,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...",NaN,8844,tt0113497,en,Jumanji,When siblings Judy and Peter discover an encha...,...,262797249.0,104.0,"[{'iso_639_1': 'en', 'name': 'English'}, {'iso...",Released,Roll the dice and unleash the excitement!,Jumanji,False,6.9,2413.0,1995

In [114]:
# Get rid of all columns you are not going to use in your analysis
new_metadata_df = metadata_df.drop(columns=['belongs_to_collection','homepage','id','original_language',
                          'overview','popularity','poster_path','production_companies','production_countries',
                         'spoken_languages','status','tagline','video','vote_average','vote_count'])

In [115]:
new_metadata_df.head()

,adult,budget,genres,imdb_id,original_title,release_date,revenue,runtime,title,year_release
0,False,30000000,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",tt0114709,Toy Story,1995-10-30,373554033.0,81.0,Toy Story,1995
1,False,65000000,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...",tt0113497,Jumanji,1995-12-15,262797249.0,104.0,Jumanji,1995
2,False,0,"[{'id': 10749, 'name': 'Romance'}, {'id': 35, ...",tt0113228,Grumpier Old Men,1995-12-22,0.0,101.0,Grumpier Old Men,1995
3,False,16000000,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...",tt0114885,Waiting to Exhale,1995-12-22,81452156.0,127.0,Waiting to Exhale,1995
4,False,0,"[{'id': 35, 'name': 'Comedy'}]",tt0113041,Father of the Bride Part II,1995-02-10,76578911.0,106.0,Father of the Bride Part II,1995

### Count '0' values in budget and revenue

In [116]:
new_metadata_df.isna().sum()

adult               0
budget              0
genres              0
imdb_id            17
original_title      0
release_date        0
revenue             6
runtime           263
title               6
year_release        0
dtype: int64

In [117]:
gross_df.head()

,title,studio,domestic_gross,foreign_gross,year,total_gross
0,Toy Story 3,BV,415000000.0,652000000.0,2010,1067000000
1,Alice in Wonderland (2010),BV,334200000.0,691300000.0,2010,1025500000
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000.0,2010,960300000
3,Inception,WB,292600000.0,535700000.0,2010,828300000
4,Shrek Forever After,P/DW,238700000.0,513900000.0,2010,752600000

In [118]:
imdb_df.head()

,movie_id,primary_title,runtime_minutes,start_year,genres
0,tt0146592,Pál Adrienn,136.0,2010,Drama
1,tt0154039,So Much for Justice!,100.0,2010,History
2,tt0162942,Children of the Green Dragon,89.0,2010,Drama
3,tt0230212,The Final Journey,120.0,2010,Drama
4,tt0312305,Quantum Quest: A Cassini Space Odyssey,45.0,2010,"Adventure,Animation,Sci-Fi"

In [119]:
studio_df = imdb_df.merge(gross_df, left_on='primary_title', right_on='title', how='inner')

In [120]:
studio_df.head(20)

,movie_id,primary_title,runtime_minutes,start_year,genres,title,studio,domestic_gross,foreign_gross,year,total_gross
0,tt0398286,Tangled,100.0,2010,"Adventure,Animation,Comedy",Tangled,BV,200800000.0,391000000.0,2010,591800000
1,tt0402887,Capture the Flag,NaN,2010,Drama,Capture the Flag,Par.,6700.0,24600000.0,2015,24606700
2,tt3896100,Capture the Flag,94.0,2015,"Adventure,Animation,Comedy",Capture the Flag,Par.,6700.0,24600000.0,2015,24606700
3,tt0419692,Disconnect,112.0,2010,"Drama,Mystery,Sci-Fi",Disconnect,LD,1400000.0,NaN,2013,0
4,tt1433811,Disconnect,115.0,2012,"Drama,Thriller",Disconnect,LD,1400000.0,NaN,2013,0
5,tt8413566,Disconnect,107.0,2018,"Comedy,Romance",Disconnect,LD,1400000.0,NaN,2013,0
6,tt0427152,Dinner for Schmucks,114.0,2010,Comedy,Dinner for Schmucks,P/DW,73000000.0,13800000.0,2010,86800000
7,tt0429493,The A-Team,117.0,2010,"Action,Adventure,Thriller",The A-Team,Fox,77200000.0,100000000.0,2010,177200000
8,tt0435761,Toy Story 3,103.0,2010,"Adventure,Animation,Comedy",Toy Story 3,BV,415000000.0,652000000.0,2010,1067000000
9,tt0446029,Scott Pilgrim vs. the World,112.0,2010,"Action,Comedy,Fantasy",Scott Pilgrim vs. the World,Uni.,31500000.0,16100000.0,2010,47600000
10,tt0455407,The Crazies,101.0,2010,"Horror,Thriller",The Crazies,Over.,39100000.0,15700000.0,2010,54800000
11,tt0464154,Piranha 3D,88.0,2010,"Comedy,Horror",Piranha 3D,W/Dim.,25000000.0,58200000.0,2010,83200000
12,tt0473075,Prince of Persia: The Sands of Time,116.0,2010,"Action,Adventure,Fantasy",Prince of Persia: The Sands of Time,BV,90800000.0,245600000.0,2010,336400000
13,tt0477080,Unstoppable,98.0,2010,"Action,Thriller",Unstoppable,Fox,81600000.0,86200000.0,2010,167800000
14,tt3070502,Unstoppable,65.0,2013,Documentary,Unstoppable,Fox,81600000.0,86200000.0,2010,167800000
15,tt2951338,Unstoppable,53.0,2015,"Biography,Documentary,History",Unstoppable,Fox,81600000.0,86200000.0,2010,167800000
16,tt7098772,Unstoppable,12.0,2017,Documentary,Unstoppable,Fox,81600000.0,86200000.0,2010,167800000
17,tt9499562,Unstoppable,52.0,2017,Documentary,Unstoppable,Fox,81600000.0,86200000.0,2010,167800000
18,tt9225192,Unstoppable,116.0,2018,"Action,Crime",Unstoppable,Fox,81600000.0,86200000.0,2010,167800000
19,tt0480255,The Losers,97.0,2010,"Action,Adventure,Crime",The Losers,WB,23600000.0,5800000.0,2010,29400000

In [121]:
studio_df[studio_df.duplicated(subset=['title','domestic_gross','total_gross'])]

,movie_id,primary_title,runtime_minutes,start_year,genres,title,studio,domestic_gross,foreign_gross,year,total_gross
2,tt3896100,Capture the Flag,94.0,2015,"Adventure,Animation,Comedy",Capture the Flag,Par.,6700.0,24600000.0,2015,24606700
4,tt1433811,Disconnect,115.0,2012,"Drama,Thriller",Disconnect,LD,1400000.0,NaN,2013,0
5,tt8413566,Disconnect,107.0,2018,"Comedy,Romance",Disconnect,LD,1400000.0,NaN,2013,0
14,tt3070502,Unstoppable,65.0,2013,Documentary,Unstoppable,Fox,81600000.0,86200000.0,2010,167800000
15,tt2951338,Unstoppable,53.0,2015,"Biography,Documentary,History",Unstoppable,Fox,81600000.0,86200000.0,2010,167800000
...,...,...,...,...,...,...,...,...,...,...,...
3078,tt8289324,A Gentleman,70.0,2018,Drama,A Gentleman,FIP,410000.0,2500000.0,2017,2910000
3146,tt6896536,Foxtrot,113.0,2017,Drama,Foxtrot,SPC,619000.0,NaN,2018,0
3156,tt1213641,First Man,141.0,2018,"Biography,Drama,History",First Man,Uni.,44900000.0,60800000.0,2018,105700000
3274,tt9042690,The Negotiation,89.0,2018,"Documentary,History,War",The Negotiation,CJ,111000.0,NaN,2018,0
3307,tt8878922,They Shall Not Grow Old,47.0,2018,"Biography,Documentary,History",They Shall Not Grow Old,WB,18000000.0,NaN,2018,0

In [122]:
working_studio_df = studio_df[~studio_df.duplicated(subset=['primary_title','domestic_gross','total_gross'])]

In [123]:
working_studio_df.isna().sum()

movie_id              0
primary_title         0
runtime_minutes      34
start_year            0
genres                6
title                 0
studio                3
domestic_gross       17
foreign_gross      1042
year                  0
total_gross           0
dtype: int64

In [124]:
working_studio_df.describe()

,runtime_minutes,start_year,domestic_gross,foreign_gross,year,total_gross
count,2571.000000,2605.000000,2.588000e+03,1.563000e+03,2605.000000,2.605000e+03
mean,107.606379,2013.506334,3.090602e+07,8.079770e+07,2014.046065,7.842300e+07
std,20.199796,2.439211,6.774873e+07,1.416526e+08,2.425897,1.760461e+08
min,5.000000,2010.000000,1.000000e+02,6.000000e+02,2010.000000,0.000000e+00
25%,94.000000,2011.000000,1.380000e+05,4.600000e+06,2012.000000,0.000000e+00
50%,105.000000,2013.000000,1.900000e+06,2.180000e+07,2014.000000,4.369000e+06
75%,119.000000,2015.000000,3.205000e+07,8.360000e+07,2016.000000,6.990000e+07
max,272.000000,2018.000000,7.001000e+08,9.464000e+08,2018.000000,1.405400e+09

In [125]:
studio_df.groupby('studio').mean()   ###### practice. delete later #################################

,runtime_minutes,start_year,domestic_gross,foreign_gross,year,total_gross
studio,,,,,,
3D,41.000000,2010.000000,6.100000e+06,9.900000e+06,2010.000000,1.600000e+07
A23,82.500000,2012.000000,8.210000e+04,NaN,2012.000000,0.000000e+00
A24,103.409091,2014.893617,6.665187e+06,1.182778e+07,2015.297872,9.680374e+06
ADC,91.000000,2015.000000,1.241000e+05,NaN,2016.000000,0.000000e+00
AF,83.571429,2014.250000,5.237375e+05,3.100000e+06,2013.250000,1.537500e+06
...,...,...,...,...,...,...
Wein.,106.034884,2013.376344,2.003826e+07,3.291611e+07,2013.666667,4.871674e+07
XL,95.000000,2012.000000,1.170000e+05,NaN,2013.000000,0.000000e+00
Yash,178.923077,2013.928571,2.965886e+06,5.022009e+07,2014.214286,3.105032e+07
Zee,148.000000,2016.000000,1.100000e+06,5.710000e+05,2016.000000,1.671000e+06
Zeit.,92.235294,2013.388889,2.031611e+05,2.914286e+06,2012.555556,1.223978e+06

# Not using data below

In [126]:
reviews_df = pd.read_csv('zippedData/rt.reviews.tsv.gz', sep = '\t', compression = 'gzip', encoding = 'latin1')

In [127]:
reviews_df              ### Will not need this data #######################

,id,review,rating,fresh,critic,top_critic,publisher,date
0,3,A distinctly gallows take on contemporary fina...,3/5,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018"
1,3,It's an allegory in search of a meaning that n...,NaN,rotten,Annalee Newitz,0,io9.com,"May 23, 2018"
2,3,... life lived in a bubble in financial dealin...,NaN,fresh,Sean Axmaker,0,Stream on Demand,"January 4, 2018"
3,3,Continuing along a line introduced in last yea...,NaN,fresh,Daniel Kasman,0,MUBI,"November 16, 2017"
4,3,... a perverse twist on neorealism...,NaN,fresh,NaN,0,Cinema Scope,"October 12, 2017"
...,...,...,...,...,...,...,...,...
54427,2000,The real charm of this trifle is the deadpan c...,NaN,fresh,Laura Sinagra,1,Village Voice,"September 24, 2002"
54428,2000,NaN,1/5,rotten,Michael Szymanski,0,Zap2it.com,"September 21, 2005"
54429,2000,NaN,2/5,rotten,Emanuel Levy,0,EmanuelLevy.Com,"July 17, 2005"
54430,2000,NaN,2.5/5,rotten,Christopher Null,0,Filmcritic.com,"September 7, 2003"
54431,2000,NaN,3/5,fresh,Nicolas Lacroix,0,Showbizz.net,"November 12, 2002"

In [128]:
movies_df  = pd.read_csv('zippedData/tmdb.movies.csv.gz')

In [129]:
movies_df

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186
...,...,...,...,...,...,...,...,...,...,...
26512,26512,"[27, 18]",488143,en,Laboratory Conditions,0.600,2018-10-13,Laboratory Conditions,0.0,1
26513,26513,"[18, 53]",485975,en,_EXHIBIT_84xxx_,0.600,2018-05-01,_EXHIBIT_84xxx_,0.0,1
26514,26514,"[14, 28, 12]",381231,en,The Last One,0.600,2018-10-01,The Last One,0.0,1
26515,26515,"[10751, 12, 28]",366854,en,Trailer Made,0.600,2018-06-22,Trailer Made,0.0,1
26516,26516,"[53, 27]",309885,en,The Church,0.600,2018-10-05,The Church,0.0,1